MINECRAFT_CLASS_COLORS_RGB = {
    "bee": (255, 215, 0),  # Золотисто-желтый
    "chicken": (255, 165, 0),  # Оранжевый (клюв/лапки)
    "cow": (139, 69, 19),  # Коричневый
    "creeper": (0, 255, 0),  # Ярко-зеленый
    "enderman": (148, 0, 211),  # Темно-фиолетовый
    "fox": (255, 69, 0),  # Рыже-красный
    "frog": (85, 107, 47),  # Оливково-зеленый
    "ghast": (240, 248, 255),  # Ледяной белый
    "goat": (245, 245, 220),  # Бежевый
    "llama": (222, 184, 135),  # Песочный / Кремовый
    "pig": (255, 182, 193),  # Светло-розовый
    "sheep": (255, 255, 255),  # Чистый белый
    "skeleton": (192, 192, 192),  # Светло-серый
    "spider": (45, 45, 45),  # Темно-серый / Черный
    "turtle": (34, 139, 34),  # Лесной зеленый
    "wolf": (176, 196, 222),  # Голубовато-серый
    "zombie": (0, 128, 128),  # Бирюзовый / Болотный
}

DEFAULT_COLOR_BGR = (128, 128, 128)  # Серый
